#MIT 6.0001 - Lecutre 1
#Heron's Algorithm for computing square roots
s = 47 #s-ийн квадрат язгуурыг олох гэж байна
g = 3 #g нь s-ийн квадрат язгуурын ойролцоогоор утга байна
nariivchlal = 0.001 
while abs(g*g-s) > nariivchlal: #g*g нь g-ийн квадрат, s нь бидний олох гэж байгаа тоо. Хэрэв g*g нь s-ээс 0.001-ээс их ялгаатай бол давталт үргэлжилнэ.
    g = (g + s/g)/2 #g нь s-ийн квадрат язгуурын ойролцоогоор утга байна. g + s/g нь g-ийн квадрат болон s-г g-ээр хуваасан утгын нийлбэрийг 2-оор хувааж байна. Энэ нь Heron's алгоритмын нэг алхам бөгөөд g-ийн утгыг сайжруулж байна.
    print(g)

print(f"47-ийн квадрат язгуур нь ойролцоогоор {g} байна.")
print(f"шалгах: {g} x {g} = {g*g}")